<img src="images/pandas-intro.png">

# Learning Agenda of this Notebook:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?

- Creating Series in Pandas
    - From Python List
    - From NumPy Arrays
    - From Python Dictionary
    - From a scalar value
    - Creating empty series object
- Attributes of a Pandas Series
- Arithmetic Operations on Series

- Dataframes in Pandas
    - Anatomy of a Dataframe
    - Creating Dataframe
        - An empty dataframe
        - Two-Dimensional NumPy Array
        - Dictionary of Python Lists
        - Dictionary of Panda Series
    - Attributes of a Dataframe
    - Bonus
- Different file formats in Pandas 
- Indexing, Subsetting and Slicing Dataframes
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

## Input and Output

- Often, you won’t be creating data but will be having it in some form, and you would want to import it to run your analysis on it. Fortunately, Pandas allows you to do this. Not only does it help in importing data, but you can also save your data in your desired format using Pandas.
- The below table shows the formats supported by Pandas, the function to read files using Pandas, and the function to write files.
|Input |Reader    |		Writer |
|------|----------|----------------|
|CSV   |read_csv  |  to_csv        |
|JSON  |read_json | to_json
|HTML  |read_html |to_html
|Excel |read_excel|to_excel
|SAS   |read_sas  |–
|Python|Pickle    |	read_pickle	to_pickle
|SQL   |read_sql  |to_sql
|Google|Big Query | read_gbq	to_gbq

## Indexing, Subsetting and Slicing Dataframes

### Motivation:
- The ability to select specific rows and columns to access and filter data based on specific conditions are two of the key features of Pandas.
    - **Selection** allows you to access specific rows or columns (a subset) of the data by their index and/or location in the DataFrame
        - In large datasets, you may be required to select the first/last N records
        - In large datasets, you may be required to select a range (n to m) of records
        - In large datasets, you may be required to select specific columns of your interest
        - In large datasets, you may be required to select specific range and specific columns of your interest
    - **Filtering** allows you to access specific rows or columns (a subset) of the data based on one or more conditions
        - In a medical dataset, you may be required to filter record of all those patients who suffer with a specific disease, or who have a specific blood group
        - In a medical dataset, you may be required to filter pregnant women who have anemia, and compare this subset to women who don’t have anemia.
        - In a travel dataset, you may be required to filter hotels inside Lahore city, sorted by their minimum per day cost
        - In a client dataset, you may be required filter the clients who use a Gmail account(may require a string filter)
        - In a client dataset, you may be required to filter the clients who belong to a specific countries (may require use of .isin() function)

### Outline
1. Understanding Indices of a Dataframe
    - Understand the Dataset
    - Changing the Column Indices of a Dataframe
    - Changing the Row Indices of a Dataframe
2. Selecting Row(s) and Column(s) of a Dataframe using `df[]` 
3. Selecting Rows and Columns using `iloc` Method
4. Selecting Rows and Columns using `loc` Method
5. Conditional Selection   
6. Selecting columns of a specific data type

In [ ]:
# df[], df.iloc[] -> work for positional indexing
# df.loc[] -> work for label indexing

### Understanding Indices of a Dataframe

<img align="right" width="300" height="300"  src="images/series-anatomy.png">

<img align="left" width="500" height="500"  src="images/dataframe.jpg">

#### Series:

- We have seen a series is a an object like a 1d array capable of holding a sequence of values of any data type.
- Every data value of series has an explicit row index associated with it ,which can be a numeric value as well as a string. 
- We have also seen that we can use these indices for three purposes for accessing the elements ,for subsetting or slicing purposes.

#### DataFrame:
- Dataframe is a 2d labeled data structure so it has two indices. A row index that moves from top to bottom is associated with rows of a dataframe and a column index that moves from left to right is associated with the columns of a dataframe. By default the row indices starts from 0 and ends at n-1 where n is the total number of rows in a dataframe and this is actually an integer identifier for the rows similarly the column indices by default also starts from 0 and ends at n-1 where n is the total number of columns in a data frame and this is actually an integer identifier for the columns.

### Understand the Dataset
- Let us first understand the dataframe on which we are going to work in today's notebook

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df

#### All attributes of the dataframe

In [ ]:
df.shape # rows and columns of the dataframe

In [ ]:
df.dtypes # data type of each column

In [ ]:
df.isnull().sum() # number of null values in each column

In [ ]:
df.isna().sum() # number of null values in each column

In [ ]:
df.columns # column names

In [ ]:
df.index # row indexes

In [ ]:
df.info() # information about the dataframe

In [ ]:
df.describe() # statistical summary and descriptive statistics

In [ ]:
df['age'].describe()

#### Changing the Column Indices/Labels of a Datarame
- Every dataframe has column labels associated with its columns
- These by default are integer values from 0,1,2,3...
- However, while creating a dataframe from scratch, or while reading them from a file you can set them to more meaningful string values.
- While reading from csv file the first row in the file is taken as the column labels
- We can change the column labels, if we want.


**rename method**

In [ ]:
# df.columns = ['roll no', 'name', 'age', 'marks'] # changing column names

# pd.read_csv('datasets/groupdata.csv', names=['roll no', 'name', 'age', 'marks']) 
# changing column names by using read_csv and `name` parameter

In [ ]:
df.columns

In [ ]:
df.rename(columns={'roll no': 'rollno'}).head()

In [ ]:
df.rename(columns={'roll no': 'rollno', 'subj1': 'python programming', 'subj2': 'statistics'}).head()

### Changing the Row Indices/Labels of a  Dataframe
- Every dataframe has row index associated with its rows
- These by default are integer values from 0,1,2,3...
- However, while creating a dataframe from scratch you may set them to some meaningful string values (seldom required).
- We have already seen this in our previous session
- Today, we will see two methods that work on row indices of a Pandas Dataframe named `df.set_index()` and `df.reset_index()`

In [ ]:
# change the row indexes
df.index

In [ ]:
df.index = ['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7', 'r8', 'r9', 'r10', 'r11', 'r12', 'r13', 'r14', 'r15' , 'r16']

In [ ]:
df.head()

**Changing Row Indices:** The `df.set_index()` method can be used to change row index of a dataframe using an existing column(s)
`df.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)`

- Where
    - `keys` is the column label 
    - `drop=True`, to drop the column from data part of dataframe that is being used as column index now
    - `append=False`, Set it to True if you want to append columns to existing index
    - `inplace=False`, Set it to True to make changes in the original dataframe, i.e., do not create a new object
    - `verify_integrity=False`, Set it to True to check the new index for duplicates. Default value of False will improve the performance of this method.

Returns Dataframe if `inplace=False` or None if `inplace=True`

In [ ]:
df1 = df.set_index(keys='roll no', drop=False)
df1.head(3)

> **Note:** The rollno column still exist as part of the dataframe. To drop it set `drop=True`

In [ ]:
df1 = df.set_index(keys='roll no', drop=True)
df1.head(3)

Another point to note is that no change has been made to the original dataframe since `inplace` arguement is by default False. Let us verify this

In [ ]:
df.head(3)

Instead of returning a dataframe, the `df.set_index()` method can change the column index inplace. Let us do that now

In [ ]:
df.set_index(keys='roll no', drop=True, inplace=True)

In [ ]:
df.head()

>Note that the roll no column has become the index now, it is no more data of the dataframe

**Changing Row Indices Back to Positional:** The `df.reset_index()` method is used to reset the row index of the dataframe back to positional integer indices

`df.reset_index(drop=False, inplace=False)`
Where
- `drop=False`, Do not try to insert index into dataframe columns. This resets the index to the default integer index.
- `inplace=False`,  Modify the DataFrame in place (do not create a new object).

Returns Dataframe if `inplace=False` or None if `inplace=True`

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
# reset the index
df2 = df.reset_index()
df2.index

In [ ]:
df2.head(3)

In [ ]:
df3 = df2.reset_index(drop=True)

In [ ]:
df3

## Selecting Column(s) and Row(s) of a Dataframe using `df[]` 


- Consider this dataframe which is sorted by ages. Note the row indices has been randomized and they do not correspond to positional indices (which we normally visualize as 0,1,2,3...)
- To access column(s) of a dataframe:
    - To access single column, mention the column index/label inside `[]`, which in this case are strings, however, can be integer values as well. It will return a new Series object.
    - To access multiple columns, pass column indices/labels as a list inside `[]`. It will return a new Dataframe object.
- To access rows(s) of a dataframe:    
    - Mention the **positional** row indices as a slice object `[start:stop:step]`, (In this case the positional indices do not match with the actual row indices). It will return a new Dataframe object.
        - `start`: specifies from where the slicing should start, inclusive (default is 0) 
        - `stop`: specifies where it has to stop, exclusive (default is end of the array) 
        - `step`:  is by-default 1
    
    
**Note:** 
- You cannot use two subscript operators `df[2][5]` to access a specific element of a dataframe as in case of numPy arrays.
- You cannot get the subset of a dataframe w.r.t rows and columns at the same time using `df[]`, it can either return a subset of columns only or rows only.
- We will soon see the `df.loc[]` and `df.iloc[]` methods that provides simpler, elegant and powerful way to subset a dataframe as compared to `df[]` syntax.

In [2]:
import pandas as pd

In [3]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0

In [4]:
df_sorted = df.sort_values('age')
df_sorted

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [5]:
df_sorted[1:2] # works for positional indexing

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example 1:** Select the data under the column `name`. Since the column labels are strings, so we mention it in single quotes.

In [6]:
s1 = df_sorted['name']
print(s1)
type(s1)

7        Adeen
15         Dua
6         Omar
10     Hussein
14     Khubaib
9       Hassan
1       Ayesha
5      Khadija
8       Zainab
12       Yusuf
2          Ali
3        Aisha
11      Muskan
4        Ahmed
0     Ehtisham
13       Amina
Name: name, dtype: object

pandas.core.series.Series

> The result is a new Series object. Since this is a series, so you can use many of the methods that you can use on Pandas Series and Dataframes, in a chained format, as shown below

In [7]:
s1.head() # s1 is a series
# or
df['name'].head() # df is a dataframe

0    Ehtisham
1      Ayesha
2         Ali
3       Aisha
4       Ahmed
Name: name, dtype: object

**Example 2:** To select multiple columns of a dataframe, pass a list of column names. The result is a new DataFrame object with the selected columns.

In [8]:
# Just get the first five rows for the columns `roll no`, `gender` and `age`
d1 = df_sorted[['roll no', 'gender', 'age']].head()
d1

    roll no  gender  age
7         8    Male    4
15       16    Male   11
6         7  Female   12
10       11    Male   12
14       15  Female   13

**Example 3:** Select the data of a single row at position 1.

In [11]:
df_sorted[1:2:1]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example 4:** Select the rows from positional index 2 to 3.

In [ ]:
df_sorted[2:4]

**Example 5:** Select the rows from positional index 0, 5, 10, and 15

In [ ]:
df_sorted[::5]

>Note that the output dataframe contains a subset of original dataframe. However, the index or row labels stays with the rows. It is not renumbered. So this means that every row is identified by a row label, which remain associated wih the row or record until you decide to reset the index

#### Resetting the Index of Subset of a Dataframe
- When we slice data from a datafeame, the row index of resulting dataframe may not be contiguous values.
- You can reset it using the `df.reset_index()` method discussed above as well.

In [ ]:
df2 = df_sorted[5:12:2]
df2

In [ ]:
df3 = df2.reset_index()
df3

>Note that the index has been reset, however, the old index is now added as a column in the dataframe. Mostly this is not required, so pass the `drop=True` argument to `reset_index()` method to avoid this.

In [ ]:
df4 = df2.reset_index(drop=True)
df4

## Selecting Rows and Columns using `iloc` Method

- The **`df.iloc[]`** is more powerful than the **`df[]`**, as it allows to filter rows as well as columns of user choice at the same time.
- It is used for filtering rows and selecting columns by **integer position** (0 to n-1) (neither by row index value/label nor by column index value/label). So you cannot mention the column names like `age` rather you need to give its positional index and that is 2.
```
df.iloc[rowstoselect, colstoselect]
```
- You can place a collon in any of the two arguments to select all rows or all columns.
- Another point to keep in mind is that the indices are by position (0 to n-1) and not by actual values of row and column indices. 
- Allowed inputs within `[ , ]` are:
     - A single integer, e.g. ``5`` (note that ``5`` is interpreted as an integer position along the index).
     - A list or array of integers, e.g.  `[9, 2, 7]`.
     - A slice object with integers, e.g. ``2:9``.
     - Note that as with usual Python slices, **stop** index is not included
     - **Note:** ``.iloc`` will raise ``IndexError`` if a requested indexer is out-of-bounds, except *slice* indexers which allow out-of-bounds indexing (this conforms with python/numpy *slice* semantics).

In [12]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df_sorted = df.sort_values('age')
df_sorted.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

### Rows Selection Only

**Example 1:** Select a single row with positional index  2 and all the columns

In [13]:
df_sorted.iloc[2,:]

roll no              7
name              Omar
age                 12
address        Sialkot
session            AFT
group          group B
gender          Female
subj1             90.2
subj2              NaN
scholarship     4000.0
Name: 6, dtype: object

> Note that the integer values are interpreted as row# (positional index) of the dataframe. Moreover a Series object is returned

**Example 2:** Select rows with positional indices 2, 4 and 1 and all the columns.

In [14]:
df_sorted.iloc[[2,4,1], :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

**Example 3:** Select rows with positional indices from 3 to 5 (stop value is not inclusive) and all the columns

In [15]:
df_sorted.iloc[3:5, :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

In [16]:
df_sorted.iloc[3:5]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0

>**In all above examples, if you omit comma and collon for the columns part, Pandas assumes it. I strongly recommend using the above style for clarity of code.**

###  Selection of Columns Only

In [17]:
df_sorted.columns

Index(['roll no', 'name', 'age', 'address', 'session', 'group', 'gender',
       'subj1', 'subj2', 'scholarship'],
      dtype='object')

**Example 1:** Select all the row values under the column at positional index 3

In [18]:
df_sorted.iloc[:,3]

7        Multan
15       Multan
6       Sialkot
10    Islamabad
14      Sialkot
9        Lahore
1     Islamabad
5        Lahore
8       Karachi
12       Lahore
2       Karachi
3        Lahore
11      Karachi
4      Peshawer
0        Lahore
13       Multan
Name: address, dtype: object

**Example 2:** Select all the row values under the column at positional index 1, 4, and 5

In [19]:
df_sorted.iloc[:, [1,4,5]]

        name    session    group
7      Adeen    MORNING  group D
15       Dua  AFTERNOON  group A
6       Omar        AFT  group B
10   Hussein        MOR  group B
14   Khubaib        AFT  group C
9     Hassan  AFTERNOON  group D
1     Ayesha        AFT  group A
5    Khadija    MORNING  group C
8     Zainab        AFT  group C
12     Yusuf    MORNING  group D
2        Ali  AFTERNOON  group B
3      Aisha        MOR  group A
11    Muskan  AFTERNOON  group C
4      Ahmed        AFT  group D
0   Ehtisham    MORNING  group C
13     Amina  AFTERNOON  group A

###  Selection of Rows + Columns
```
df.iloc[whatrowsIwant, whatcolumnsIwant]
```
- You can use a single value, a list of multiple values, or a slice object for selecting rows
- You can use a single value, a list of multiple values, or a slice object for selecting columns

**Example 1:** Select only the rows at positional index 3 and 0, and from those two rows select only columns at positional index 1 and 5

In [20]:
df_sorted.iloc[[3, 0], [1, 5]]

       name    group
10  Hussein  group B
7     Adeen  group D

**Example 2:** Select only the rows at positional index 0 to 4 (stop index is not inclusive), and from those two rows select only columns at positional index 2 and 3

In [21]:
df_sorted.iloc[0:5, 2:4]

    age    address
7     4     Multan
15   11     Multan
6    12    Sialkot
10   12  Islamabad
14   13    Sialkot

## Selecting Rows and Columns using `df.loc[]` Method

- The **`df.loc[]`** is also used for filtering rows and selecting columns but by row index value/label or by column index value/label (NOT by position). 
```
df.loc[rowstoselect, colstoselect]
```
- You can place a collon in any of the two arguments to select all rows or all columns.
- Another point to keep in mind is that the indices are NOT by position, rather by actual values of row and column indices. 
- Allowed inputs within `[ , ]` are:
     - A single label, e.g. `5` or `'a'`, (note that `5` is interpreted as actual index/label **NOT** as an integer position along the index).
     - A list or array of labels, e.g. `[9, 2, 7]`
     - A slice object with labels, e.g. `[3:6:2]` 
     - **Warning:** Note that contrary to usual Python slices, **both** the start and the stop are included

In [23]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df_sorted = df.sort_values('age')
df_sorted

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

**Example:** Select rows with row indices 2, 4 and 1 and all the columns

In [24]:
df_sorted.loc[[2,4,1], :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0

**Example:** Select all the row values under the columns with labels `name`, `address`, and `scholarship`

In [25]:
df_sorted.loc[:, ['name', 'address', 'scholarship']]

        name    address  scholarship
7      Adeen     Multan       8000.0
15       Dua     Multan       3800.0
6       Omar    Sialkot       4000.0
10   Hussein  Islamabad       6000.0
14   Khubaib    Sialkot       3500.0
9     Hassan     Lahore       3800.0
1     Ayesha  Islamabad       6000.0
5    Khadija     Lahore          NaN
8     Zainab    Karachi       3500.0
12     Yusuf     Lahore       7000.0
2        Ali    Karachi       8500.0
3      Aisha     Lahore       4000.0
11    Muskan    Karachi          NaN
4      Ahmed   Peshawer       3500.0
0   Ehtisham     Lahore       5000.0
13     Amina     Multan       8000.0

**Example:** Select rows with row indices 0 to 5 (Stop index is inclusive), and from those six rows select columns `name`, `age` and `session`

In [32]:
df_sorted.loc[4:0, ['name', 'age', 'session']]

       name  age  session
4     Ahmed   21      AFT
0  Ehtisham   23  MORNING

In [33]:
df_sorted.loc[3:13, ['name', 'age', 'session']]

        name  age    session
3      Aisha   20        MOR
11    Muskan   20  AFTERNOON
4      Ahmed   21        AFT
0   Ehtisham   23    MORNING
13     Amina   28  AFTERNOON

>**Always keep the row indices of your dataframe as 0, 1, 2, 3, 4, ... and the column indices as meaningful labels. If after a slicing or sorting operation, the row indices are a bit disturbed, use `df.reset_index()` method to adjust your row indices match the positional indices.**

## Conditional Selection
- Suppose we want to select only those rows where the age value is greater than 20. Note this time the dataframe has row indices that match with the positional indices.

In [34]:
# Let us read a fresh dataframe and sort it by age column to have a clear understanding about indexing
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Male,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Female,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Female,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Male,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Male,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Female,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Male,90.5,81.3,3800.0

###  Option 1:
- Create a Python list having Boolean values of exact same length as the rows of the dataframe 
- The value in the list need to be True for the row which we want to select
- Convert the Python list to a Pandas series
- Finally pass that series to the dataframe

In [43]:
list1 = []
for length in df.age:
    if length > 20:
        list1.append(True)
    else:
        list1.append(False)
print(list1)

[True, False, False, False, True, False, False, False, False, False, False, False, False, True, False, False]

In [44]:
df[list1]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

###  Option 2:
- Instead of creating a Boolean list using the loop, use the condition inside the `df[cond]` operator, that will automatically generate the Boolean list.

In [45]:
df[df.age > 20]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [46]:
df[df['age'] > 20]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

### Option 3:
- Best way is to use the **`df.loc[cond]`** method.

In [47]:
df.loc[df['age'] > 20, :]

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Female,65.9,72.8,3500.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [48]:
# Using 'loc' gives you the facility to slice the required columns as well
df.loc[df['age'] > 20, ['name', 'age']]

        name  age
0   Ehtisham   23
4      Ahmed   21
13     Amina   28

### Conditional Selection based on  Multiple Conditions
- Suppose we want to get all the records of the dataframe where the age value is greater than 20 and belong to Multan
- For this use multiple conditions inside parenthesis and use logical operators (`&`, `|`) in between
```
df[(condition1) op (condition2) op (condition3)]
```

In [ ]:
df

In [ ]:
(df.age < 20) & (df.address != 'Multan')

In [ ]:
df[(df.age < 20) & (df.address != 'Multan')]

In [ ]:
df[(df.age < 20) & (df.address == 'Multan')]

In [ ]:
# Select records of group A male students only
df1 = df[(df.group == 'group A') & (df.gender == 'Male')]  
df1

In [ ]:
# Select the records of students who belong to Sialkot or Karachi
df1 = df[(df.address == 'Sialkot') | (df.address == 'Karachi')]
df1

In [ ]:
# Select records who lives outside Karachi and earn a scholarship of greater than 7000, or lives in Peshawer
out = df[(df.address != 'Karachi') & (df.scholarship > 7000) | (df.address == 'Peshawer')]
out

**If there are many conditions connected with or operator, you can simplify it using the `series.isin()` method as shown below:**

In [ ]:
df[df.address.isin(['Sialkot', 'Karachi','Peshawer'])]

##  Selecting columns of a specific data type
- The `df.select_dtypes()` method is used to get a subset of the dataframe to select columns of a specific datatype(s) 
```
df.select_dtypes(include, exclude)
```

- `include` and `exclude` arguments can be scalar or list-like
- Atleast one of these parameters must be supplied

In [ ]:
# Let us first check the data types of each column
df.dtypes

In [ ]:
# Select the columns with object (categorical) data type
df.select_dtypes(include=['object'])

In [ ]:
# Select the columns with integer (numerical) data type and float data type
df.select_dtypes(include=['int', 'float'])

## Practice Questions

### Regiment
- A regiment is a military unit. Its role and size varies markedly, depending on the country, service and/or a specialisation.

#### Step 1. Import the necessary libraries

#### Step 2. Create the `DataFrame` with the following values and Assign it to a variable called `regiment`.

In [ ]:
# Create an example dataframe about a fictional army
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [ ]:
# craete a dataframe from the raw data
regiment = pd.DataFrame(raw_data)
regiment.head()

### Description of the columns in the dataframe
- **regiment:** The name or identifier of the military unit.
- **company:** The specific company within the regiment.
- **deaths:** Number of soldiers who have died in battles.
- **battles:** Number of battles the regiment has participated in.
- **size:** Total size of the regiment, indicating the number of soldiers.
- **veterans(retired solider):** Number of experienced and seasoned soldiers.
- **readiness:** The state of preparedness or readiness of the regiment. (The country maintained a high level of military preparedness)
- **armored:(Bombproof)** Presence of armored units within the regiment.
- **deserters:** Number of soldiers who have deserted or abandoned their posts.
- **origin:** The origin or place of hiring for the regiment.

#### Step 3. Set the `origin` column as the index of the dataframe.

In [ ]:
regiment = regiment.set_index('origin')
regiment

#### Step 4. Print only the column `veterans`

#### Step 5. Print the columns 'veterans' and 'deaths'

#### Step 6. Select the `deaths`,`size` and `deserters` columns from `Texas` and `Alaska`.

#### Step 7. Select the rows 3 to 7 and the columns 3 to 6

#### Step 8. Select every row after the fourth row and all columns

#### Step 9. Select all the rows and the 3rd column up to the 7th column

#### Step 10. Select rows where df.deaths is greater than 50

#### Step 11. Select rows where `df.deaths` is greater than 500 or less than 50.

#### Step 12. Select all the regiments not named `Dragoons`.

#### Step 13. Select the rows called Texas and Arizona

## Check Your Concepts:
- What is Pandas?
- How to iterate over rows in Pandas Dataframe 
- Different ways to iterate over rows in Pandas Dataframe 
- Selecting rows in pandas DataFrame based on conditions 
- Select any row from a Dataframe using iloc[] and iat[] in Pandas 
- Limited rows selection with given column in Pandas | Python 
- Drop rows from the dataframe based on certain condition applied on a column 
- Insert row at given position in Pandas Dataframe 
- Create a list from rows in Pandas dataframe 
- Ranking Rows of Pandas DataFrame 
- Sorting rows in pandas DataFrame 
- Select row with maximum and minimum value in Pandas dataframe 
- Get all rows in a Pandas DataFrame containing given substring 
- Convert a column to row name/index in Pandas 
- How to randomly select rows from Pandas DataFrame

# Pandas - Assignment No 01
- Click here to solve [Pandas - Assignment no 01](https://www.kaggle.com/code/ehtishamsadiq/pandas-assignment-no-01)

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)